EnKF-Training-codes/foam_base/case2_/system/sampleDict1
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox           |
|  \\    /   O peration     | Version:  v2012                                 |
|   \\  /    A nd           | Website:  www.OpenFOAM.com                      |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       dictionary;
    location    "system";
    object      sampleDict;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //
libs ("libsampling.so");
type    surfaces;
interpolationScheme cellPoint;
setFormat       raw;
surfaceFormat   raw;
surfaces
(
    walls_constant
    {
        type    patch;
        patches ( wall );
    }
);

fields          (wallHeatFlux p);


// *********************************************************************** //
